# (1) 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리)
#
# (2) 텍스트마이닝 기반 데이터 분석 (부제: 텍스트 기반 데이터 분석 및 처리)
#
# (3) 빅데이터 분석 결과 시각화 (부제 : 데이터베이스 기반 데이터 분석 및 GUI 시각화)
#
#
#
#
# ** 빵 먹으면서 풀기 **
#
#
#
#
# ** 먼저 카페에서 "Fedora 22 (MySQL 설치) 다운로드" 하기
#
#
#
#
# 복습퀴즈1. MySQL에서 다음과 같이 작업하시오.
#
#
#
#
#  (1) 사용자 생성 : 자신 이름 영문 약자 (예:홍길동은 root/1234)
#
#
#
#
#  (2) 데이터베이스 생성 : 자신 이름 영문 약자 (예:홍길동은 hongDB)
#
#
#
#
#  (3) 사원테이블(사번, 이름, 직급, 입사년도, 월급여) 생성
#
#
#
#
#  (4) 데이터를 적당히 3건 입력 --> 영문으로 입력
#
#
#
#
#
#
#
# 복습퀴즈2. GUI 툴에 메뉴 추가하기. (카페에서 마지막 버전 사용)
#
#
#
#
#    [MySQL 데이터 분석] - [MySQL 정보읽기] 및 [MySQL 정보쓰기]
#
#
#
#
#
#
#
# 퀴즈1.  자동화(CSV -> SQLite)를 GUI 분석툴에 추가하기.
#
#
#
#
#    [대량 데이터 처리 자동화]  -  [대량 CSV --> SQLite]
#
#
#
#
# 퀴즈2. 자동화(CSV -> MySQL) 로 처리하기.
#
#
#
#
#    [대량 데이터 처리 자동화]  -  [대량 CSV --> MySQL]
#
#
#
#
# vmware.com/workstation --> 평가판 Windows용
#
#
#
#
# 퀴즈3. [대량 데이터 처리 자동화]  -  [SQLite --> 대량 CSV]
#
#       각 테이블별로 별도의 CSV 파일 생성
#
#
#
#
# 퀴즈4. [대량 데이터 처리 자동화]  -  [MySQL --> 대량 CSV]
#
#       각 테이블별로 별도의 CSV 파일 생성
#
#
#
#
# 퀴즈5. [영상처리 툴]에 메뉴 추가
#
#
#
#
#   [RAW <--> CSV]  --  [CSV로 내보내기]
#
#                            --  [CSV(셔플)로 내보내기]
#
#
#
#
# 과제 : [SQLite에서 불러오기]
#
#     --> 영상 목록이 출력되고 (cat01:128 ....)
#
#  선택하면 화면에 로딩























