#   파이썬 응용 프로그래밍
#
#   파이썬 영상 처리 (이미지 프로세싱)
#
#   파이썬 데이터베이스 + 영상 저장
#
#   Linux, Windows Server 기반의 빅데이터 처리.
#
#   미니 프로젝트 : 2~3건
#
#
#
#
#   퀴즈1. 거북이 완성하기.
#
#    -  펜 색상, 두께 랜덤하게
#
#    -  거북이 색상과 크기는 가운데 버튼 누르면 바뀌기..
#
#   심화퀴즈1. 더블클릭하면 왔다 돌아가기.
#
#
#
#
#   퀴즈2. p113. 10번
#
#   심화퀴즈2. 입력된 숫자를 8진수 거북이로 표현.
#
#                 (거북이 크기 1~8)
#
#
#
#
#
#
#
#   퀴즈3. 행,열을 입력받고, 1부터 채워나가기. 출력 보기좋게.
#
#   2,3 -->  1  2  3
#
#               4  5  6
#
#   심화퀴즈3. 거꾸로 채우기...
#
#
#
#
# cafe.naver.com/mobileEducation
#
#
#
#
# --> 회원가입 후에 퀴즈 제출 (퀴즈 제출방)