# (1) 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리)
#
# (2) 텍스트마이닝 기반 데이터 분석 (부제: 텍스트 기반 데이터 분석 및 처리)
#
# (3) 빅데이터 분석 결과 시각화 (부제 : 데이터베이스 기반 데이터 분석 및 GUI 시각화)
#
#
#
#
# 퀴즈1.  quiz06-01.py 를 만들고,
#
# 명령 프롬프트에서 파라미터 2개가
#
# 출력되도록 하기.
#
#
#
#
# 퀴즈2. 값을 모두 100$ 인상시킨 것을 result03.csv 에 출력하세요.
#
#
#
#
# 퀴즈3. result03.csv에 출력
#
#          조건1. 5개 열 중에서 part Number와 Purchase Date는 제거한다.
#
#          조건2. Supplier Y 행은 지운다.
#
#          조건3. 가격을 모두 1.5배 인상시킨다.
#
#                    그리고, 100달러 미만 단위는 버린다.  770 --> 700
#
#
#
#
# 심화퀴즈3.  열이 굉장히 많다고 가정해서 part Number와 Purchase Date의
#
#  위치를 모른다.
#
#
#
#
# 퀴즈4. supplier_data.csv 파일을 GUI로 출력하기.
#
#
#
#
# 퀴즈5. 위 퀴즈3을 GUI로 출력되기.
#
#
#
#
# 퀴즈6. 퀴즈5를 메뉴 추가해서 실행하기.
#
#         [CSV 분석] - [특정 열,행 제거]
#
#
#
#
# 퀴즈7. 폴더를 선택한 후, *.csv 파일을 모두 합쳐서
#
# 화면에 보이기.
#
#     [CSV 파일 합치기]