## 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리) ##


# 복습퀴즈1.GIF
# 영상
# 데이터
# 분석
#
# [파일] - [열기]
# 에서
# GIF
# 영상을
# 선택한
# 후에
# 다음의
# 내용이
# 윈도창의
# Label에
#
# 출력되도록
# 한다.
#
# 최소 / 최다
# 출현
# r픽셀값: (138, 1)(189, 1612)
#
# 최소 / 최다
# 출현
# g픽셀값: (137, 1)(209, 1298)
#
# 최소 / 최다
# 출현
# b픽셀값: (10, 1)(99, 2531)
#
# r, g, b픽셀
# 평균값: 194.80955
# 159.2699
# 109.461
#
# r, g, b픽셀
# 중위수: 196
# 157
# 91
#
# 복습퀴즈2. --> 이
# 문제는
# 제출
# 하지
# 말것
#
# 자신이
# 나온
# 사진
# 3
# 장을
# 준비해서
# 각각
# 512
# x512, 256
# x256, 128
# x128, 64
# x64로
#
# GIF, JPG(또는
# PNG), RAW
# 파일을
# 만든다.(PaintShop
# 사용): 총
# 36
# 장
# 파일
#
# (파일명은 woo512.gif, woo512.jpg, woo512.raw  등의 형식을 사용 권장.)
#
# 복습퀴즈3(선택).p325.그림판
# 만들기
#
# 10
# 시까지
# 카페에
# 제출하세요
#
# 제목: [빅데이터]
# 복습퀴즈
# 10 / 02, 홍 * 동
#
# ** 디지털
# 영상
# 처리(Digital
# Image
# Processing) **
#
# (1)
# 화소점
# 처리(Pixel
# Processing): 한개
# 점을
# 처리하기, 화소값이
# 변경
#
# 동일영상, 화소값반전, 밝게하기(덧셈연산), 어둡게(뺄셈), 곱셈,
#
# 나눗셈, 파라볼라(Cap, Cup), 감마, ...
#
# (2)
# 기하학
# 처리(Geometry
# Processing): 한개
# 점을
# 처리.화소값은
# 그대로, 위치변경
#
# 상하반전, 좌우반전, 이동, 회전, 확대, 축소...
#
# (3)
# 화소영역
# 처리(Area
# Processing): 여러개
# 점이
# 관련되어
# 처리.
#
# 엠보싱, 블러링, 샤프닝, 에지검색(종류
# 수십개), 잡음제거
#
# 퀴즈1.화소점처리
# 모두
# 구현해
# 보기.
#
# 심화퀴즈1.화면
# 출력을
# 원영상과
# 결과영상이
# 모두
# 보이도록...
#
# 퀴즈2.데이터분석
# 메뉴: 빈도수
# 최댓값 & 최솟값
#
# 심화퀴즈2.[평균값(범위)]
# 에서
# 입력된 % 의
# 상하위
# 개수를
# 제거하고, 평균
# 처리
#
# 예) 10
# 을
# 입력하면
# 상위10 %, 하위10 % 를
# 제거한
# 나머지
# 80 % 의
# 평균
#
# 퀴즈3.확대(전방향), 확대(역방향)
# 처리하기