# ## 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리) ##
#
#
#
#
# 복습퀴즈1. 숫자 정렬하기. p221참조.
#
#   1~100까지 1000개의 숫자를 임의로 생성한 후에, 각 숫자의 발생빈도를 순위로
#
#   매겨서 출력한다. 단, 동일 순위의 경우 1등,2등,2등,4등 식으로 부여한다.
#
#
#
#
# 복습퀴즈2. 문자열의 발생 빈도수 체크.
#
#   p241을 처리하되, 딕셔너리를 사용하지 말고 리스트로만 처리한다.
#
#
#
#
# 복습퀴즈3(심화). 1부터 999까지 100개의 숫자를 임의로 생성한 후에, 뒤에서 두번째
#
#   숫자로 내림 차순 정렬한다.
#
#    단, 뒤에서 두번째 숫자가 동일하면 마지막 숫자로 정렬한다.
#
#   ( 한자리 숫자의 경우 001 식으로, 두자리 경우 011 식으로 처리한다.)
#
#
#
#
#   예)  092   838   071  004  037
#
#         --> 092  071  838  037  004
#
#
#
#
# 10시까지 카페에 제출하세요
#
# 제목 :  [빅데이터] 복습퀴즈 10/01, 홍*동
#
#
#
#
#
#
#
# 퀴즈1. 키보드 이벤트 처리하기.
#
#    키보드 누를때,  대문자/소문자/숫자/기타로 구분해서 메시지 보이기.
#
#    예) 대문자를 눌렀네요..   기타를 눌렀네요..
#
#
#
#
# 퀴즈2. [편집] 메뉴 추가  복사/잘라내기/붙여넣기...
#
#
#
#
# 퀴즈3. p323. 동물 투표..
#
#
#
#
# 퀴즈3(심화). p322. 10번
#
#
#
#
#
#
#
# ** 오후에는 [GIF 영상 데이터 분석 및 간단 통계 처리]
#
#
#
#
# 퀴즈4. GIF영상의 R, G, B값 각각의 최대출현, 최소출현
#
#          R,G,B 각각의 평균값, 중위수
#
#
#
#
# 최소/최다 출현 r픽셀값: (138, 1) (189, 1612)
#
# 최소/최다 출현 g픽셀값: (137, 1) (209, 1298)
#
# 최소/최다 출현 b픽셀값: (10, 1) (99, 2531)
#
# r,g,b픽셀 평균값: 194.80955 159.2699 109.461
#
# r,g,b픽셀 중위수: 196 157 91
#
#
#
#
#
#
#
# ** 자신이 필요한 사진을 512x512, 256x256, 128x128, 64x64 각각 3장씩
#
#     raw로 만들기.
#
#
#
#
# 5시 20분에 이어서...
#
#
#
#
# 퀴즈5. [영상처리] 메뉴 추가하고,  [밝게하기], [어둡게하기], [반전하기]
#
#   ....
#
#
#
#
# 과제 : 영상처리를 위한 알고리즘이 어떤 것이 있는지 알아보고, 메뉴에 추가해 놓기.
#
#   15개