# (1) 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리)
#
# (2) 텍스트마이닝 기반 데이터 분석 (부제: 텍스트 기반 데이터 분석 및 처리)
#
# (3) 빅데이터 분석 결과 시각화 (부제 : 데이터베이스 기반 데이터 분석 및 GUI 시각화)
#
#
#
#
# 복습퀴즈1. 3개 csv 파일을 읽어서, Sales Amount의 총합계와 평균을 구한 후,
#
#   print()로 출력한다.
#
#   sales_january_2014.csv, sales_february_2014.csv, sales_march_2014.csv
#
#
#
#
# 복습퀴즈2. GUI 화면에 위 1번을 추가한다.
#
#   * 파일이 없으면 카페의 "CSV 처리 7 - GUI"  사용
#
#
#
#
# 복습퀴즈3(선택). RAW 파일을 분석해서 각 픽셀의 개수의 통계를 CSV파일에 저장한다.
#
# 예)  lena256.raw의 분석
#
# 화소값  개수
#
#  0        12
#
#  1        5
#
#  2        33
#
# ...
#
# 255      77