# ## 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리) ##
#
#
# 복습퀴즈1.GIF
# 영상
# 데이터
# 분석
#
# [파일] - [열기]
# 에서
# GIF
# 영상을
# 선택한
# 후에
# 다음의
# 내용이
# 윈도창의
# Label에
#
# 출력되도록
# 한다.
#
# 최소 / 최다
# 출현
# r픽셀값: (138, 1)(189, 1612)
#
# 최소 / 최다
# 출현
# g픽셀값: (137, 1)(209, 1298)
#
# 최소 / 최다
# 출현
# b픽셀값: (10, 1)(99, 2531)
#
# r, g, b픽셀
# 평균값: 194.80955
# 159.2699
# 109.461
#
# r, g, b픽셀
# 중위수: 196
# 157
# 91
#
# 복습퀴즈2. --> 이
# 문제는
# 제출
# 하지
# 말것
#
# 자신이
# 나온
# 사진
# 3
# 장을
# 준비해서
# 각각
# 512
# x512, 256
# x256, 128
# x128, 64
# x64로
#
# GIF, JPG(또는
# PNG), RAW
# 파일을
# 만든다.(PaintShop
# 사용): 총
# 36
# 장
# 파일
#
# (파일명은 woo512.gif, woo512.jpg, woo512.raw  등의 형식을 사용 권장.)

