# ## 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리) ##
#
#
#
#
# 복습퀴즈1. 800x800 화면에서 거북이가 다음 정보를 소유하도록 한다.
#
#  [거북이개체, (시작x,y), (끝x,y), (r,g,b), 크기]
#
#      20마리를 생성해서 리스트에 저장한 후에, 각각 이동하도록 한다.
#
#
#
#
# 복습퀴즈2. 구구단을 처리하되, 각 결과의 앞자리~뒷자리까지 합계로 출력한다.
#
#    예)  2x1=3   (값2를 02로 취급해서 0부터 2까지의 합계 : 0+1+2 = 3)
#
#          2x2=10 (값2를 02로 취급해서 0부터 2까지의 합계 : 0+1+2+3+4 = 10)
#
#          ...
#
#          2x9=36  (값18을 1부터 8까지 : 1+2+3+4+5+6+7+8=36)
#
#          ...
#
#          8x8=15  (값64를 6부터 4까지 : 6+5+4 = 15)
#
#
#
#
# 복습퀴즈3(심화). 행과 열의 크기를 입력받고, 크기만큼 가로 및 세로로 지그재그로
#
#    1부터 출력한다.
#
#     예) 3, 4를 입력하면
#
#          1   2  3   4
#
#          8   7  6   5
#
#          9 10 11 12
#
#
#
#
#          1   6  7  12
#
#          2   5  8  11
#
#          3   4  9  10
#
#
#
#
# 10시까지 카페에 제출하세요
#
# 제목 :  [빅데이터] 복습퀴즈 9/28, 홍*동
#
#
#
#
# 퀴즈1. 한글 글자의 빈도수를 출력하고, 많은 빈도수의 차례대로 순위를 매기기.
#
#          (동일 순위 처리하기)
#
#
#
#
# 심화퀴즈1. 단어들에 대한 빈도수 처리하기..
#
#

