# ## 통계 기반 데이터 분석 (부제: 영상 처리를 통한 데이터 분석 및 통계 처리) ##
#
#
#
#
# 복습퀴즈1. 숫자 정렬하기. p221참조.
#
#   1~100까지 1000개의 숫자를 임의로 생성한 후에, 각 숫자의 발생빈도를 순위로
#
#   매겨서 출력한다. 단, 동일 순위의 경우 1등,2등,2등,4등 식으로 부여한다.
#
#
#
#
# 복습퀴즈2. 문자열의 발생 빈도수 체크.
#
#   p241을 처리하되, 딕셔너리를 사용하지 말고 리스트로만 처리한다.
#
#
#
#
# 복습퀴즈3(심화). 1부터 999까지 100개의 숫자를 임의로 생성한 후에, 뒤에서 두번째
#
#   숫자로 내림 차순 정렬한다.
#
#    단, 뒤에서 두번째 숫자가 동일하면 마지막 숫자로 정렬한다.
#
#   ( 한자리 숫자의 경우 001 식으로, 두자리 경우 011 식으로 처리한다.)
#
#
#
#
#   예)  092   838   071  004  037
#
#         --> 092  071  838  037  004